<?php

namespace Andegna\Ethiopian;

/**
 * Interface Constants.
 */
class DateConstant
{
    public static $MONTHS_NAME = [
        1 => 'መስከረም', 'ጥቅምት', 'ኅዳር', 'ታኅሣሥ',
        'ጥር', 'የካቲት', 'መጋቢት', 'ሚያዝያ', 'ግንቦት',
        'ሰኔ', 'ሐምሌ', 'ነሐሴ', 'ጳጉሜን',
    ];

    public static $WEEK_NAME_AM = [
        1 => 'ሰኞ', 'ማክሰኞ', 'ረቡዕ',
        'ሓሙስ', 'ዓርብ', 'ቅዳሜ', 'እሑድ',
    ];

    public static $ORTHODOX_DAY_NAME = [
        1 => 'ልደታ', 'አባ፡ጉባ', 'በእታ', 'ዮሐንስ', 'አቦ',
        'ኢያሱስ', 'ሥላሴ', 'አባ፡ኪሮስ', 'ቶማስ', 'መስቀል',
        'ሐና፡ማርያም', 'ሚካኤል', 'እግዚሐር፡አብ', 'አቡነ፡አረጋዊ',
        'ቂርቆስ', 'ኪዳነ፡ምሕረት', 'እስጢፋኖስ', 'ተክለ፡አልፋ',
        'ገብርኤል', 'ሕንፅተ', 'ማርያም', 'ኡራኤል', 'ጊዮርጊስ',
        'ተክለ፡ሐይማኖት', 'መርቆርዮስ', 'ዮሴፍ', 'መድኀኔ፡ዓለም',
        'አማኑኤል', 'ባለ፡እግዚአብሔር', 'ማርቆስ',
    ];
}
